MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_icache.h
/** @defgroup ICACHE_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Indicate the status of an ongoing operation flag.
  * @rmtoll
  *  SR           BUSYF         LL_ICACHE_IsActiveFlag_BUSY
  * @param  icachex ICACHE instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ICACHE_IsActiveFlag_BUSY(const ICACHE_TypeDef *icachex)
{
  return ((STM32_READ_BIT(icachex->SR, ICACHE_SR_BUSYF) == (ICACHE_SR_BUSYF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of an operation end flag.
  * @rmtoll
  *  SR           BSYENDF      LL_ICACHE_IsActiveFlag_BSYEND
  * @param  icachex ICACHE instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ICACHE_IsActiveFlag_BSYEND(const ICACHE_TypeDef *icachex)
{
  return ((STM32_READ_BIT(icachex->SR, ICACHE_SR_BSYENDF) == (ICACHE_SR_BSYENDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of an error flag.
  * @rmtoll
  *  SR           ERRF          LL_ICACHE_IsActiveFlag_ERR
  * @param  icachex ICACHE instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ICACHE_IsActiveFlag_ERR(const ICACHE_TypeDef *icachex)
{
  return ((STM32_READ_BIT(icachex->SR, ICACHE_SR_ERRF) == (ICACHE_SR_ERRF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear busy end of operation flag.
  * @rmtoll
  *  FCR          CBSYENDF      LL_ICACHE_ClearFlag_BSYEND
  * @param  icachex ICACHE instance.
  */
__STATIC_INLINE void LL_ICACHE_ClearFlag_BSYEND(ICACHE_TypeDef *icachex)
{
  STM32_WRITE_REG(icachex->FCR, ICACHE_FCR_CBSYENDF);
}

/**
  * @brief  Clear error flag.
  * @rmtoll
  *  FCR          ERRF          LL_ICACHE_ClearFlag_ERR
  * @param  icachex ICACHE instance.
  */
__STATIC_INLINE void LL_ICACHE_ClearFlag_ERR(ICACHE_TypeDef *icachex)
{
  STM32_WRITE_REG(icachex->FCR, ICACHE_FCR_CERRF);
}

/** @brief  Clear the ICACHE flag(s).
  * @rmtoll
  *  FCR          CBSYENDF      LL_ICACHE_ClearFlag \n
  *  FCR          ERRF          LL_ICACHE_ClearFlag
  * @param  icachex ICACHE instance.
  * @param  mask This parameter is a combination of the following values:
  *            @arg @ref LL_ICACHE_FCR_CBSYENDF  Busy end clear flag
  *            @arg @ref LL_ICACHE_FCR_CERRF     Cache error clear flag
  *            @arg @ref LL_ICACHE_FCR_ALL       Clear all flags
  */
__STATIC_INLINE void LL_ICACHE_ClearFlag(ICACHE_TypeDef *icachex, uint32_t mask)
{
  STM32_WRITE_REG(icachex->FCR, mask);
}

/** @brief  Check whether the selected ICACHE flag(s) is(are) set or not.
  * @rmtoll
  *  SR           BUSYF         LL_ICACHE_IsActiveFlag \n
  *  SR           BSYENDF       LL_ICACHE_IsActiveFlag \n
  *  SR           ERRF          LL_ICACHE_IsActiveFlag
  * @param  icachex ICACHE instance.
  * @param  interrupt Specifies the flag to check.
  *         This parameter can be any combination of the following values:
  *            @arg @ref LL_ICACHE_SR_BUSYF    Busy flag
  *            @arg @ref LL_ICACHE_SR_BSYENDF  Busy end flag
  *            @arg @ref LL_ICACHE_SR_ERRF     Cache error flag
  * @retval Return 1 if at least one flag is set; otherwise 0.
  */
__STATIC_INLINE uint32_t LL_ICACHE_IsActiveFlag(const ICACHE_TypeDef *icachex, uint32_t interrupt)
{
  return ((STM32_READ_BIT(icachex->SR, interrupt) == (interrupt)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup ICACHE_LL_EF_REGION_Management REGION_Management
  * @{
  */

/**
  * @brief  Enable the remapped memory region.
  * @rmtoll
  *  CRRx         REN           LL_ICACHE_EnableRegion
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @note   The region must have been already configured.
  */
__STATIC_INLINE void LL_ICACHE_EnableRegion(ICACHE_TypeDef *icachex, uint32_t region)
{
  STM32_SET_BIT(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))), ICACHE_CRRx_REN);
}

/**
  * @brief  Disable the remapped memory region.
  * @rmtoll
  *  CRRx         REN           LL_ICACHE_DisableRegion
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  */
__STATIC_INLINE void LL_ICACHE_DisableRegion(ICACHE_TypeDef *icachex, uint32_t region)
{
  STM32_CLEAR_BIT(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))), (ICACHE_CRRx_REN));
}

/**
  * @brief  Return whether the remapped memory region is enabled.
  * @rmtoll
  *  CRRx         REN           LL_ICACHE_IsEnabledRegion
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ICACHE_IsEnabledRegion(const ICACHE_TypeDef *icachex, uint32_t region)
{
  return ((STM32_READ_BIT(*((__IO const uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                          (ICACHE_CRRx_REN)) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Select the memory remapped region base address.
  * @rmtoll
  *  CRRx         BASEADDR      LL_ICACHE_SetRegionBaseAddress
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @param  base_address Alias address in the Code region
  * @note   The useful bits depend on RSIZE as described in the Reference Manual.
  */
__STATIC_INLINE void LL_ICACHE_SetRegionBaseAddress(ICACHE_TypeDef *icachex, uint32_t region, uint32_t base_address)
{
  STM32_MODIFY_REG(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                   ICACHE_CRRx_BASEADDR, ((base_address & 0x1FFFFFFFU) >> LL_ICACHE_ADDRESS_SHIFT));
}

/**
  * @brief  Get the memory remapped region base address.
  * @rmtoll
  *  CRRx         BASEADDR      LL_ICACHE_GetRegionBaseAddress
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @note   The useful bits depend on RSIZE as described in the Reference Manual.
  * @retval base_address Alias address in the Code region
  */
__STATIC_INLINE uint32_t LL_ICACHE_GetRegionBaseAddress(const ICACHE_TypeDef *icachex, uint32_t region)
{
  return (STM32_READ_BIT(*((__IO const uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                         ICACHE_CRRx_BASEADDR) << LL_ICACHE_ADDRESS_SHIFT);
}

/**
  * @brief  Select the memory remapped region remap address.
  * @rmtoll
  *  CRRx         REMAPADDR      LL_ICACHE_SetRegionRemapAddress
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @param  remap_address Memory address to remap
  * @note   The useful bits depend on RSIZE as described in the Reference Manual.
  */
__STATIC_INLINE void LL_ICACHE_SetRegionRemapAddress(ICACHE_TypeDef *icachex, uint32_t region, uint32_t remap_address)
{
  STM32_MODIFY_REG(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))), ICACHE_CRRx_REMAPADDR, \
                   ((remap_address >> LL_ICACHE_ADDRESS_SHIFT) << ICACHE_CRRx_REMAPADDR_Pos));
}

/**
  * @brief  Get the memory remapped region base address.
  * @rmtoll
  *  CRRx         REMAPADDR      LL_ICACHE_GetRegionRemapAddress
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @note   The useful bits depend on RSIZE as described in the Reference Manual.
  * @retval remap_address Remapped memory address
  */
__STATIC_INLINE uint32_t LL_ICACHE_GetRegionRemapAddress(const ICACHE_TypeDef *icachex, uint32_t region)
{
  return ((STM32_READ_BIT(*((__IO const uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                          ICACHE_CRRx_REMAPADDR) >> ICACHE_CRRx_REMAPADDR_Pos) << LL_ICACHE_ADDRESS_SHIFT);
}

/**
  * @brief  Select the memory remapped region size.
  * @rmtoll
  *  CRRx         RSIZE      LL_ICACHE_SetRegionSize
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @param  size This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGIONSIZE_2MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_4MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_8MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_16MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_32MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_64MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_128MB
  */
__STATIC_INLINE void LL_ICACHE_SetRegionSize(ICACHE_TypeDef *icachex, uint32_t region, uint32_t size)
{
  STM32_MODIFY_REG(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                   ICACHE_CRRx_RSIZE, (size << ICACHE_CRRx_RSIZE_Pos));
}

/**
  * @brief  Get the selected memory remapped region size.
  * @rmtoll
  *  CRRx         RSIZE      LL_ICACHE_GetRegionSize
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ICACHE_REGIONSIZE_2MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_4MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_8MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_16MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_32MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_64MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_128MB
  */
__STATIC_INLINE uint32_t LL_ICACHE_GetRegionSize(const ICACHE_TypeDef *icachex, uint32_t region)
{
  return (STM32_READ_BIT(*((__IO const uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                         ICACHE_CRRx_RSIZE) >> ICACHE_CRRx_RSIZE_Pos);
}

/**
  * @brief  Select the memory remapped region output burst type.
  * @rmtoll
  *  CRRx         HBURST      LL_ICACHE_SetRegionOutputBurstType
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @param  burst This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_OUTPUT_BURST_WRAP
  *         @arg @ref LL_ICACHE_OUTPUT_BURST_INCR
  */
__STATIC_INLINE void LL_ICACHE_SetRegionOutputBurstType(ICACHE_TypeDef *icachex, uint32_t region, uint32_t burst)
{
  STM32_MODIFY_REG(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                   ICACHE_CRRx_HBURST, burst);
}

/**
  * @brief  Get the selected memory remapped region output burst type.
  * @rmtoll
  *  CRRx         HBURST      LL_ICACHE_GetRegionOutputBurstType
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ICACHE_OUTPUT_BURST_WRAP
  *         @arg @ref LL_ICACHE_OUTPUT_BURST_INCR
  */
__STATIC_INLINE uint32_t LL_ICACHE_GetRegionOutputBurstType(const ICACHE_TypeDef *icachex, uint32_t region)
{
  return (STM32_READ_BIT(*((__IO const uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                         ICACHE_CRRx_HBURST));
}

/**
  * @brief  Select the memory remapped region cache master port.
  * @rmtoll
  *  CRRx         MSTSEL      LL_ICACHE_SetRegionMasterPort
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @param  port Master_port field which can have one of the following values:
  *         @arg @ref LL_ICACHE_MASTER1_PORT
  * @if ICACHE_CRRx_MSTSEL
  *         @arg @ref LL_ICACHE_MASTER2_PORT
  * @endif
  */
__STATIC_INLINE void LL_ICACHE_SetRegionMasterPort(ICACHE_TypeDef *icachex, uint32_t region, uint32_t port)
{
  STM32_MODIFY_REG(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                   LL_ICACHE_MASTERPORT_MASK, port);
}

/**
  * @brief  Get the selected memory remapped region cache master port.
  * @rmtoll
  *  CRRx         MSTSEL      LL_ICACHE_GetRegionMasterPort
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @retval uint32_t Returned value can have one of the following values:
  *         @arg @ref LL_ICACHE_MASTER1_PORT
  * @if ICACHE_CRRx_MSTSEL
  *         @arg @ref LL_ICACHE_MASTER2_PORT
  * @endif
  */
__STATIC_INLINE uint32_t LL_ICACHE_GetRegionMasterPort(const ICACHE_TypeDef *icachex, uint32_t region)
{
#if defined(LL_ICACHE_MASTER2_PORT)
  return (STM32_READ_BIT(*((__IO const uint32_t *)(&(icachex->CRR0) + (1U * region))), \
                         ICACHE_CRRx_MSTSEL));
#else
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(icachex);
  STM32_UNUSED(region);

  return LL_ICACHE_MASTER1_PORT;
#endif /* LL_ICACHE_MASTER2_PORT */
}

/**
  * @brief  Set the remap region configuration.
  * @rmtoll
  *  CRRx         BASEADDR    LL_ICACHE_SetConfigRemapRegion \n
  *  CRRx         REMAPADDR   LL_ICACHE_SetConfigRemapRegion \n
  *  CRRx         RSIZE       LL_ICACHE_SetConfigRemapRegion \n
  *  CRRx         HBURST      LL_ICACHE_SetConfigRemapRegion \n
  *  CRRx         MSTSEL      LL_ICACHE_SetConfigRemapRegion
  * @param  icachex ICACHE instance.
  * @param  region This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGION_0
  *         @arg @ref LL_ICACHE_REGION_1
  *         @arg @ref LL_ICACHE_REGION_2
  *         @arg @ref LL_ICACHE_REGION_3
  * @param  base_address  Alias address in the Code region.
  * @param  remap_address External memory address.
  * @param  size This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_REGIONSIZE_2MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_4MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_8MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_16MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_32MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_64MB
  *         @arg @ref LL_ICACHE_REGIONSIZE_128MB
  * @param  master_port This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_MASTER1_PORT
  * @if ICACHE_CRRx_MSTSEL
  *         @arg @ref LL_ICACHE_MASTER2_PORT
  * @endif
  * @param  output_burst This parameter can be one of the following values:
  *         @arg @ref LL_ICACHE_OUTPUT_BURST_WRAP
  *         @arg @ref LL_ICACHE_OUTPUT_BURST_INCR
  */
__STATIC_INLINE void LL_ICACHE_SetConfigRemapRegion(ICACHE_TypeDef *icachex, uint32_t region, uint32_t base_address,
                                                    uint32_t remap_address, uint32_t size, uint32_t master_port,
                                                    uint32_t output_burst)
{
  STM32_WRITE_REG(*((__IO uint32_t *)(&(icachex->CRR0) + (1U * region))),
                  (((base_address & 0x1FFFFFFFU) >> LL_ICACHE_ADDRESS_SHIFT)) |
                  ((remap_address >> LL_ICACHE_ADDRESS_SHIFT) << ICACHE_CRRx_REMAPADDR_Pos) |
                  (size << ICACHE_CRRx_RSIZE_Pos) | master_port | output_burst);
}

/**
  * @brief  Get the remap region configuration.
  * @rmtoll
  *  CRRx         BASEADDR    LL_ICACHE_GetConfigRemapRegion \n
  *  CRRx         REMAPADDR   LL_ICACHE_GetConfigRemapRegion \n
  *  CRRx         RSIZE       LL_ICACHE_GetConfigRemapRegion \n
  *  CRRx         HBURST      LL_ICACHE_GetConfigRemapRegion \n
  *  CRRx         MSTSEL      LL_ICACHE_GetConfigRemapRegion
  * @param  icachex ICACHE instance.
  * @param  region Region number.
  * @retval uint32_t Return the value of the CRRx register.
  */
__STATIC_INLINE uint32_t LL_ICACHE_GetConfigRemapRegion(const ICACHE_TypeDef *icachex, uint32_t region)
{
  return (STM32_READ_REG(*((__IO const uint32_t *)(&(icachex->CRR0) + (1U * region)))));
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* ICACHE */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_ICACHE_H */
